mrnoise/MicroTrait/MSP430/GPIO/Gpio.hpp
/** @defgroup groupMSP430 MSP430
* MSP430 specific code
*/

/** @defgroup groupMSP430Gpio GPIO
 *  @ingroup groupMSP430
* @brief functions for GPIO hardware access for TIs MSP430 -> Ti Driverlib equivalent naming
*
* @details
* Usage: \code {.cpp}

#include "MicroTrait/MT.hpp"

using namespace MT::MSP430;

    GPIO::Port1 p1{};
    GPIO::Port2 p2{};
    p1.setOutputLowOnPin(GPIO::PIN::P0);
    p1.setAsOutputPin(GPIO::PIN::P0);

    p2.setAsInputPinWithPullUp(GPIO::PIN::P3);
    p2.selectInterruptEdge(GPIO::INT_EDGE::HIGH_TO_LOW, GPIO::PIN::P3);
    p2.enableInterrupt(GPIO::PIN::P3);
    p2.clearInterrupt(GPIO::PIN::P3);

    p1.setAsInputPinWithPullUp(GPIO::PIN::P4);
    p1.selectInterruptEdge(GPIO::INT_EDGE::HIGH_TO_LOW, GPIO::PIN::P4);
    p1.enableInterrupt(GPIO::PIN::P4);
    p1.clearInterrupt(GPIO::PIN::P4);

\endcode
*
* @author Steffen Fuchs
*<br> Email: admin@definefalsetrue.com
*<br> Web: https://definefalsetrue.com
*
****************************************************************
*/


/** @defgroup groupFuncsMSP430Gpio Functions
*  @ingroup groupMSP430Gpio
*  Functions in this module
*/

/** @defgroup groupEnumsMSP430Gpio Enums
*  @ingroup groupMSP430Gpio
*  Enums in this module
*/

#ifndef MICROTRAIT_MSP430_GPIO_GPIO_HPP_
#define MICROTRAIT_MSP430_GPIO_GPIO_HPP_

#include "MicroTrait/MSP430/Settings.hpp"
#include "MicroTrait/MSP430/Types.hpp"

#ifdef MT_USE_MSP430_LIB

#include "MicroTrait/Misc/Details.hpp"
#include "MicroTrait/Misc/EnumBits.hpp"
#include "MicroTrait/Universal/Register.hpp"
#include <stdint.h>
#include <type_traits>
#include <msp430.h>

#define GPIO_REGISTER_WIDTH uint8_t

namespace MT::Misc {
enum class GPIO_PIN : GPIO_REGISTER_WIDTH {
    P0 = (1U << 0U),
    P1 = (1U << 1U),
    P2 = (1U << 2U),
    P3 = (1U << 3U),
    P4 = (1U << 4U),
    P5 = (1U << 5U),
    P6 = (1U << 6U),
    P7 = (1U << 7U)
};
template<>
struct enable_Enum_bits<GPIO_PIN> {
    static constexpr bool enable = true;
};
}// namespace MT::Misc

namespace MT::MSP430::GPIO {

/**
* @ingroup groupEnumsMSP430Gpio
****************************************************************
* @brief MSP430 GPIO PINs
****************************************************************
*/
using PIN = MT::Misc::GPIO_PIN;

/**
* @ingroup groupEnumsMSP430Gpio
****************************************************************
* @brief Interrupt edge selection
****************************************************************
*/
enum class INT_EDGE : uint8_t {
    LOW_TO_HIGH = 0,
    HIGH_TO_LOW
};

/**
* @ingroup groupEnumsMSP430Gpio
****************************************************************
* @brief GPIO module selection
****************************************************************
*/
enum class MODULE_FUNC : uint_fast8_t {
    GPIO = 0,
    PRIMARY,
    SECONDARY,
    TERNARY,
};

/**
* @ingroup groupEnumsMSP430Gpio
****************************************************************
* @brief GPIO pin state
****************************************************************
*/
enum class PIN_STATE : uint_fast8_t {
    LOW = 0,
    HIGH
};

#if defined(__MSP430F5XX_6XX_FAMILY__)
/**
* @ingroup groupEnumsMSP430Gpio
****************************************************************
* @brief GPIO drive strength -> only available for MSP430F5xx/6xx Family
****************************************************************
*/
enum class DRV_STRENGTH : uint_fast8_t {
    REDUCED = 0,
    FULL
};
#endif

namespace Internal {

    template<volatile auto *INREG, volatile auto *OUTREG>
    struct PortCommon {

      private:
        MT::Universal::Register<INREG>  m_in{};
        MT::Universal::Register<OUTREG> m_out{};

      public:
        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief sets the given Pins high if configured as a output
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.setOutputHighOnPin(GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BITS use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
        constexpr void setOutputHighOnPin(const BIT &bit, const BITS &... bits) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");
            m_out.set(bit, bits...);
        }

        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief sets the given Pins low if configured as a output
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.setOutputLowOnPin(GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BITS use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
        constexpr void setOutputLowOnPin(const BIT &bit, const BITS &... bits) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");
            m_out.clear(bit, bits...);
        }

        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief toggles the given Pins if configured as a output
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.toggleOutputOnPin(GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BITS use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
        constexpr void toggleOutputOnPin(const BIT &bit, const BITS &... bits) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");
            m_out.toggle(bit, bits...);
        }


        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief returns the Pin state (high or low) if configured as a input
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  if(p1.getInputPinValue(GPIO::PIN::P0) == GPIO::PIN_STATE::HIGH) doSomething(); \endcode
		*@tparam BITS use enumeration GPIO::PIN
		*@return the Pin state (GPIO::PIN_STATE)
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
        [[nodiscard]] constexpr PIN_STATE getInputPinValue(const BIT &bit, const BITS &... bits) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");
            if (m_in.compare(bit, bits...)) return PIN_STATE::HIGH;
            else
                return PIN_STATE::LOW;
        }
    };

